Revit 2027 API
ParameterTypeId.EnergyAnalysisConceptualConstruction Property
 "Conceptual Types"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId EnergyAnalysisConceptualConstruction { get; }
Public Shared ReadOnly Property EnergyAnalysisConceptualConstruction As ForgeTypeId
	Get
public:
static property ForgeTypeId^ EnergyAnalysisConceptualConstruction {
	ForgeTypeId^ get ();
}
static member EnergyAnalysisConceptualConstruction : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace